XYZUtils.XYZ.unit
Make this a unit vector or return ERR_NULL_VECTOR if the vector is nearly zero.

XYZUtils.XYZ.#ctor(System.Double,System.Double,System.Double)
construct from components

XYZUtils.XYZ.basis(System.Int32)
returns a unit vector in the X, Y or Z direction for dim values of 0, 1 or 2 respectively

XYZUtils.XYZ.basisZ
returns a unit vector in the Z-direction (0, 0, 1)

XYZUtils.XYZ.basisY
returns a unit vector in the Y-direction (0, 1, 0)

XYZUtils.XYZ.basisX
returns a unit vector in the X-direction (1, 0, 0)

XYZUtils.XYZ.zero
returns (0, 0, 0)

XYZUtils.XYZ
'XYZUtils::XYZ' is a class that represents a 3d vector or a 3d point.
Remarks:
By default XYZUtils::XYZ is initialized to {0.0, 0.0, 0.0}.